THESSALONIKI_HISTORY_TEXT = """
Ιστορία της Θεσσαλονίκης έως την Απελευθέρωση
Η Θεσσαλονίκη εικάζεται πως ιδρύθηκε στη θέση της αρχαίας Θέρμης, η οποία αποτελούσε τον σημαντικότερο οικισμό της περιοχής. Από τη Θέρμη, πήρε το όνομα του ο Θερμαϊκός Κόλπος. Η ακριβής θέση του οικισμού δεν είναι γνωστή και δεν πρέπει να γίνεται σύνδεση με την περιοχή που σήμερα έχει την ίδια ονομασία. Η αρχαία Θέρμη βρισκόταν κοντά στη θάλασσα μιας και αποτελούσε σημαντικό λιμάνι εκείνης της εποχής και το πιθανότερο είναι να βρισκόταν στη θέση που βρίσκεται το σημερινό Καραμπουρνάκι.

Θεωρείτο το σημαντικότερο λιμάνι της ευρύτερης περιοχής για πολλούς αιώνες, αφού διατηρούσε εμπορικές σχέσεις με όλες τις πόλεις του τότε ελληνικού κόσμου. Όπως αναφέρει ο Ηρόδοτος, ο στρατός αλλά και το ναυτικό του Ξέρξη, στρατοπέδευσαν στη Θέρμη κατά τη διάρκεια της εκστρατείας τους στην Ελλάδα.

Ίδρυση της πόλης:
Η περίοδος μετά το θάνατο του Μεγάλου Αλέξανδρου (323 π.Χ) χαρακτηρίζεται από μεγάλες ανακατατάξεις . Η αυτοκρατορία που είχε δημιουργήσει ο μεγάλος στρατηλάτης εκτεινόταν από τη Μακεδονία μέχρι τη Βακτριανή, την Ινδία και την Αίγυπτο. Τον θάνατο του ακολούθησε η διάσπαση της αυτοκρατορίας ανάμεσα στους διαδόχους.

Η Θεσσαλονίκη, ιδρύεται το 316/315 π.Χ. από τον τότε βασιλιά της Μακεδονίας Κάσσανδρο, με την συγχώνευση των οικισμών που υπήρχαν στην γύρω περιοχή.

Ο Κάσσανδρος υπήρξε διοικητής της Μακεδονίας, κατά τη διάρκεια της εκστρατείας του Μεγάλου Αλέξανδρου στην Ανατολή. Διαδραμάτισε σημαντικό ρόλο στην πολιτική ζωή της περιοχής μετά το θάνατο του Μεγάλου Αλεξάνδρου και ανακηρύχθηκε βασιλιάς της Μακεδονίας το 306 π.Χ.

Εκείνη την εποχή ανθίζει το εμπόριο σε όλο τον ελληνικό κόσμο. Η Πέλλα, η πρωτεύουσα της Μακεδονίας δεν μπορούσε να αντεπεξέλθει στις ανάγκες της νέας εποχής μιας και δεν είχε άμεση επαφή με τη θάλασσα (επικοινωνούσε μέσω καναλιών).

Ο Κάσσανδρος αναγνωρίζοντας τη στρατηγική σημασία της περιοχής γύρω από τον Θερμαΐκό κόλπο, θέλησε να δημιουργήσει ένα οικονομικό και εμπορικό κέντρο για τη Μακεδονία, το όποιο θα τη συνέδεε με τις υπόλοιπες ελληνικές πόλεις. Θέλοντας να αναδείξει τη μεγάλη σημασία που είχε για αυτόν η νέα πόλη, της έδωσε το όνομα της γυναίκας του, Θεσσαλονίκης, κόρη του Φιλίππου Β’.

Η θέση της νέας πόλης ήταν ιδανική από κάθε άποψη. Βορειοδυτικά συνδεόταν με την Πέλλα την πρωτεύουσα της Μακεδονίας. Ανατολικά με τις απαραίτητες για την γεωργία και την κτηνοτροφία εύφορες εκτάσεις της Καλαμαριάς, με την Αμφίπολη και τη Θράκη. Και νότια η έξοδος προς τον Θερμαΐκό κόλπο.

Αποτέλεσμα της γεωγραφικής θέσης της, ήταν η Θεσσαλονίκη να παίξει πρωταγωνιστικό ρόλο στο εμπόριο της ευρύτερης περιοχής. Η ανάπτυξη της Θεσσαλονίκης προσέλκυσε κάτοικους των γύρω περιοχών από το Βορρά και από τις υπόλοιπες ελληνικές πόλεις, με αποτέλεσμα τη γρήγορη αύξηση του πληθυσμού της.

Εμπορεύματα και ταξιδιώτες έφταναν με καράβια στο λιμάνι της Θεσσαλονίκης από κάθε σημείο της Μεσογείου. Οι κάτοικοι της έρχονται σε επαφή με ξένες ιδέες, πολιτισμούς και θρησκείες, όπως φαίνεται από τη διάδοση ξένων λατρειών.
Η μεγάλη εμπορική δραστηριότητα προσέλκυσε και το Εβραϊκό στοιχείο. Η πρώτη εγκατάσταση των Εβραίων στη Θεσσαλονίκη πραγματοποιείται τον 3ο αι. π.Χ. Εκείνη την εποχή Εβραίοι κατοικούσαν και δραστηριοποιούνταν σχεδόν σε όλες τις περιοχές της Μεσογείου που είχαν εμπορική σημασία.

Η οικονομική ανάπτυξη της πόλης ενισχύθηκε ακόμα περισσότερο με την κυκλοφορία του δικού της νομίσματος, που διευκόλυνε ακόμα περισσότερο τις εμπορικές συναλλαγές. Η Θεσσαλονίκη απέκτησε δικαίωμα νομισματοκοπίας το 187 π.Χ. Το δικαίωμα αυτό παραχωρήθηκε (όπως και σε άλλες πόλεις της Μακεδονίας) από τον Φίλιππο Ε’.

Η Θεσσαλονίκη αποτελούσε μέρος του βασιλείου της Μακεδονίας έχοντας σχετική αυτονομία στη διοίκηση της. Η οργάνωση της πόλης ακολουθεί τα πρότυπα των άλλων ελληνικών πόλεων, με βουλή και εκκλησία του δήμου. Στην λειτουργία της πόλης επεμβαίνει η κεντρική διοίκηση του Μακεδονικού βασιλείου με τους εκεί εκπρόσωπους του και την έκδοση βασιλικών διαγραμμάτων. Η παρέμβαση της κεντρικής διοίκησης δεν είχε ως στόχο μόνο την εσωτερική λειτουργία της πόλης, αλλά και τον έλεγχο στις σχέσεις που είχε η Θεσσαλονίκη με τις υπόλοιπες ελληνικές πόλεις.

Παράλληλα με το εμπόριο και τη βιοτεχνία που άνθιζε στην Θεσσαλονίκη, αναπτύχθηκε στις γύρω περιοχές η γεωργία και η κτηνοτροφία. Η εύφορη γη και η δυνατότητα άρδευσης βοήθησαν στην παράγωγη ποικίλων προϊόντων.

Ρωμαϊκή εποχή
Η Μακεδονία και μαζί η Θεσσαλονίκη υποτάσσεται στους Ρωμαίους το 168 π.Χ. μετά την μεγάλη νίκη του ύπατου Λεύκιου Αιμίλιου Παύλου έναντι του Περσέα τελευταίου βασιλιά της Μακεδονίας.

Η Θεσσαλονίκη βρέθηκε υπό τον έλεγχο του Αιμίλιου Παύλου. Η Μακεδονία χωρίστηκε σε τέσσερις διοικητικές περιφέρειες (“μερίδες”) με στόχο να αποφευχθεί μελλοντική συμμαχία ενάντια στη Ρώμη. Η Θεσσαλονίκη έγινε η πρωτεύουσα της δεύτερης περιφέρειας (Macedonia secunda), που εκτεινόταν από τον Στρυμόνα μέχρι τον Αξιό. Οι υπόλοιπες περιφέρειες είχαν ως κέντρα την Αμφίπολη, την Πέλλα, και την Ηράκλεια της Πελαγονίας.

Η σημαντικότερη εξέγερση κατά της Ρώμης οργανώθηκε από τον Αδραμυτιανό Ανδρίσκο . Η ήττα του στρατού του από τον Κόντιο Καικίλιο Μάτελλο οριστικοποίησε την κυριαρχία της Ρώμης στην περιοχή. Οι τέσσερις επαρχίες ενώθηκαν και ανακηρύχθηκαν Ρωμαϊκή επαρχία της Μακεδονίας.

Στην ανάδειξη της Θεσσαλονίκης ως σημείο αναφοράς της επαρχίας της Μακεδονίας ευνόησε η στρατηγική της θέση, άλλα και η στάση που τήρησαν οι κάτοικοι της κατά την εξέγερση του Ανδρίσκου.
Η Θεσσαλονίκη απέκτησε τεράστια σημασία στο πλαίσιο αυτής της νέας διευρυμένης επαρχίας και αντιμετωπίζεται με εύνοια από τους Ρωμαίους. Επιλέχθηκε ως έδρα του Ρωμαίου διοικητή της Μακεδονίας, διατηρεί την παλιά της πολιτική οργάνωση και έχει το δικό της νόμισμα.

Η ζωή των κατοίκων της Θεσσαλονίκης ωστόσο δεν ήταν καθόλου εύκολη.
Η βαριά φορολογία και η λεηλασία του πλούτου της πόλης από τους εκάστοτε διοικητές δοκίμαζαν τις αντοχές των κατοίκων.

Το ενδιαφέρον των Ρωμαίων για την Ανατολή συμβάλει στην ανάπτυξη της Θεσσαλονίκης. Η πόλη γίνεται σημαντικός στρατιωτικός και εμπορικός σταθμός μετά και την κατασκευή της Εγνατίας οδού (146- 120 π.Χ.) από τον ανθύπατο Γναίος Εγνάτιος. Ο σπουδαίος αυτός δρόμος ξεκινούσε από την τις ανατολικές ακτές της Αδριατικής, και έφτανε ως τον Έβρο. Η Εγνατία συνδεόταν με τη δυτική είσοδο της πόλης και ακολουθούσε περίπου τον σημερινό δρόμο προς Καβάλα. Η Εγνατία οδός που διασχίζει σήμερα το κέντρο της πόλης αποτελεί προέκτασή της.

Η επέκταση της Ρωμαϊκής αυτοκρατορίας προς βορρά, αναβαθμίζει ακόμα περισσότερο τη Θεσσαλονίκη καθώς αποτελεί τη βασική έξοδο από το βορρά προς τη θάλασσα.

Κατά τη διάρκεια του εμφυλίου πολέμου της Ρώμης μεταξύ των δημοκρατικών και των αυτοκρατορικών, η Θεσσαλονίκη αποτέλεσε σημαντικό κέντρο εξελίξεων. Ο Πομπήιος μαζί με πιστούς σε αυτόν ύπατους και συγκλητικούς, εγκαθίσταται για λίγο στη Θεσσαλονίκη. Μετά τον θάνατο του Ιουλίου Καίσαρα ( 42 π.Χ), οι δολοφόνοι του, Βρούτος και Κάσσιος καταφεύγουν στη Μακεδονία. Η Θεσσαλονίκη υποστηρίζοντας τους αυτοκρατορικούς, Αντώνιο και Οκταβιανό, αρνήθηκε να δεχτεί τους Βρούτο και Κάσσιο. Χαρακτηριστική είναι και η αντίδραση του Βρούτου, πριν τη μάχη των Φιλίππων, που υποσχέθηκε ότι θα επιτρέψει στους στρατιώτες του να λεηλατήσουν τη Θεσσαλονίκη εάν νικούσαν.

Μέτα τη μάχη των Φιλίππων, οι Θεσσαλονικείς υποδέχονται τους νικητές Αντώνιο και Οκταβιανό με ιδιαίτερες τιμές, και στήνεται τιμητική αψίδα προς τιμήν τους.

Οι νικητές ανταμείβουν τους κατοίκους της Θεσσαλονίκης για τη στάση τους, ανακηρύσσοντάς την “ελεύθερη πόλη”. Η Θεσσαλονίκη αποκτά αρκετά προνόμια και οι κάτοικοι απαλλάσσονται από τη φορολογία.

Στα χρόνια που ακολουθούν η πόλη απολαμβάνει την ειρήνη και η επέκταση της Ρωμαϊκής αυτοκρατορίας προς την ανατολή και τον βορά απομακρύνουν τον κίνδυνο επιθέσεων από τα βαρβαρικά φύλα. Η Θεσσαλονίκη ως “ελεύθερη πόλη” εξελίσσεται ως κέντρο πολιτισμού στα Βαλκάνια. Διοργανώνονται μεγάλες γιορτές τα Ολύμπια και τα Πύθια, μουσική και γυμναστικοί αγώνες, αντίστοιχοι αυτών της Ολυμπίας.

Ο Απόστολος Παύλος κηρύσσει στη Θεσσαλονίκη το 50 μ.Χ η οποία έγινε η “ Χρύση Πύλη” για τη διάδοση του Χριστιανισμού στην Ευρώπη. Ο Απόστολος Παύλος κηρύσσει αρχικά στην Εβραϊκή συναγωγή της πόλης και ακολουθούν συγκεντρώσεις πιστών σε σπίτια και δημόσιους χώρους.

Οι Εβραίοι της Θεσσαλονίκης, δυσαρεστημένοι με τη μεγάλη απήχηση του κηρύγματος του Απόστολου Παύλου αντέδρασαν. Ο απόστολος εκδιώκεται από την πόλη, όμως παρά τις αντιδράσεις αρκετοί κάτοικοι της πόλης ασπάστηκαν τις ιδέες του Χριστιανισμού και δημιουργούν την πρώτη χριστιανική κοινότητα. Η Θεσσαλονίκη τους επόμενους αιώνες θα αποτελέσει σημείο αναφοράς του χριστιανικού κόσμου.

Στα μέσα του 3ου αιώνα μ.Χ παρατηρείται κινητικότητα στη βαλκανική χερσόνησο και νέοι κίνδυνοι απειλούν την Μακεδονία και τη Θεσσαλονίκη, η οποία αποτελεί το σημαντικότερο σταυροδρόμι της περιοχής.

Η Θεσσαλονίκη δέχεται τρεις Επιδρομές των Γότθων την περίοδο 254-269. Και στις τρεις κατάφερε να μείνει όρθια και να απωθήσει τους εισβολείς χάρη στα ισχυρά της τείχη και την σθεναρή αντίσταση των κατοίκων της.

Σε μια περίοδο εντόνων εξελίξεων στη ρωμαϊκή αυτοκρατορία, το 293 μ.Χ. ιδρύεται η Τετραρχία και η αυτοκρατορία κυβερνάται από τους Διοκλητιανό, Μαξιμιανό, Κωνστάντιο Χλωρό και Γαλέριο.

Η ρωμαϊκή αυτοκρατορία πλέον αποτελείται από δυο τμήματα, το ανατολικό και το δυτικό. Ο Διοκλητιανός και ο Γαλέριος διοικούν το ανατολικό τμήμα και ο Μαξιμιανός με τον Κωνσταντίνο τον Χλωρό το δυτικό τμήμα.

Έδρα του Γαλερίου μετά το Σίρμιο έγινε η Θεσσαλονίκη στην οποία έχτισε σημαντικά ρωμαϊκά δημόσια κτήρια. Το Γαλεριανό Ανάκτορό, τη Rotonda, την Αψίδα του Γαλέριου (Καμάρα), τον ιππόδρομο, και την Ρωμαϊκή Αγορά.

Όταν ξεκίνησαν οι διωγμοί των Χριστιανών, με διαταγή του Γαλέριου συλλαμβάνεται και εκτελείται με μαρτυρικό θάνατο ο Άγιος Δημήτριος, ο οποίος είχε αναλάβει πλούσια φιλανθρωπική και θρησκευτική δράση για να μεταδώσει τις Χριστιανικές ιδέες.

Μετά τον Θάνατο του Διοκλητιανού και του Μαξιμιανού η Ρωμαϊκή Αυτοκρατορία βρίσκεται στη δύση της και παρακμάζει. Εξωτερικοί και εσωτερικοί παράγοντες προκαλούν μετατόπιση του ενδιαφέροντος στην ανατολή έως ότου αντικατασταθεί οριστικά από την Βυζαντινή αυτοκρατορία.

Βυζαντινή εποχή
Ο 4oς αιώνας φέρνει μεγάλες αλλαγές στη Ρωμαϊκή αυτοκρατορία και κατ’ επέκταση στη Θεσσαλονίκη. Σταματούν οι διωγμοί των χριστιανών και ο χριστιανισμός επικρατεί οριστικά ως η κύρια θρησκεία. Η πρωτεύουσα της Ρωμαϊκής αυτοκρατορίας μεταφέρεται στην Κωνσταντινούπολη (330) και η Θεσσαλονίκη μπαίνει σε μια νέα πορεία συμβασιλεύουσας . Η Βυζαντινή Θεσσαλονίκη εξελίσσεται σε σημαντικό κέντρο χριστιανισμού και συχνά αποτελεί σημείο αναφοράς στις πολιτικές εξελίξεις της αυτοκρατορίας.

Η Θεσσαλονίκη χάρη στην ισχυρή γεωπολιτική της θέσει παίζει πρωταγωνιστικό ρόλο στην οικονομική και πνευματική εξέλιξη της ευρύτερης περιοχής. Στους αιώνες που ακολουθούν εμφανίζονται νέοι κίνδυνοι που απειλούν την πόλη.

Το 322/23 βρίσκεται στην πόλη ο Μέγας Κωνσταντίνος κατά τις προετοιμασίες για την επερχόμενη σύγκρουση του με τον Λικίνιο, διοικητή του ανατολικού τμήματος της αυτοκρατορίας. Κατά τη διαμονή του στην Θεσσαλονίκη κατασκευάζει λιμάνι στο νοτιοδυτικό άκρο της πόλης για να οργανώσει εκεί τον ισχυρό του στόλο. Ο Κωνσταντίνος νικά τον Λικίνιο και τον αιχμαλωτίζει, για να τον στείλει εξόριστο στη Θεσσαλονίκη όπου μετά από λίγους μήνες θανατώνεται με εντολή του πρώτου.

Το 379 ο Μέγας Θεοδόσιος κάνει τη Θεσσαλονίκη έδρα του για να αντιμετωπίσει τους Γότθους οι οποίοι κατά ομάδες λεηλατούσαν την Μακεδονία, τη Θράκη και την Θεσσαλία. Αφού νίκησε τους Γότθους (378) προχώρησε σε ανοικοδόμηση των τειχών και ενίσχυσε την οχύρωση της πόλης. Ο Θεοδόσιος βαπτίζεται χριστιανός από τον αρχιεπίσκοπο Θεσσαλονίκης και εκδίδει διάταγμα με το οποίο ο χριστιανισμός γίνεται η επίσημη θρησκεία του κράτoυς .

Σφαγή στον Ιππόδρομο

Ο Θεοδόσιος όμως συνέδεσε το όνομα του με ένα τραγικό για τους Θεσσαλονικείς γεγονός, τη σφαγή 7.000 χριστιανών στον Ιππόδρομο το 390.
Ο Θεοδόσιος αφού επικράτησε έναντι των Γότθων, τους κάνει συμμάχους και τους αντιμετωπίζει προνομιακά για να τους καταστήσει ακίνδυνους αλλά και χρήσιμους. Αρκετοί Γότθοι καταλαμβάνουν σημαντικά αξιώματα και προκαλούν την αγανάκτηση των κατοίκων της Θεσσαλονίκης.

Σε αυτό το κλήμα ο Θεοδόσιος κατά τη διάρκεια μιας εκστρατείας του στη δύση, αφήνει στη Θεσσαλονίκη τον Γότθο Βουτέριχο ως στρατιωτικό διοικητή. Την παραμονή των αρματοδρομιών ο Βουτέριχος συλλαμβάνει έναν δημοφιλή Θεσσαλονικιό ηνίοχο προκαλώντας την αντίδραση των κατοίκων, που ζητούν επίμονα την απελευθέρωση του αγαπημένου τους αρματοδρόμου.

Ο Βουτέριχος αρνείται να ελευθερώσει τον ηνίοχο και οι κάτοικοι εξαγριωμένοι ξεσπούν σε γενικευμένη εξέγερση. Οι δυσαρεστημένοι κάτοικοι τη πόλης εισβάλουν σε δημόσια κτήρια σκοτώνοντας αρκετούς γότθους αξιωματούχους και μαζί με αυτούς τον Βουτέριχο και στρατιώτες της φρουράς του.

Ο Θεοδόσιος μόλις πληροφορήθηκε τα γεγονότα που εκτυλίχθηκαν στην Θεσσαλονίκη κατά την απουσία του, στέλνει μυστική διαταγή με την οποία θα εκδικηθεί με τον χειρότερο τρόπο τους εξεγερμένους.

Έτσι ανακοινώνεται διεξαγωγή αγώνων στον ιππόδρομο προς τιμήν του αυτοκράτορα και οι Θεσσαλονικείς σπεύδουν κατά χιλιάδες να τους παρακολουθήσουν. Όταν ο Ιππόδρομος γέμισε,δίνεται εντολή από τον Θεοδόσιο και Γότθοι στρατιώτες που βρίσκονταν γύρω από αυτόν, όρμησαν και κατέσφαξαν αδιακρίτως 7000 άνδρες, γυναίκες και παιδιά.

Το γεγονός αυτό διαδίδεται γρήγορα σε όλες τις γωνίες της αυτοκρατορίας προκαλώντας τη βαθιά θλίψη των κατοίκων της. Ο επίσκοπος Μεδιολάνων Αμβρόσιος υποχρεώνει τον Θεοδόσιο να ζητήσει δημόσια συγνώμη.

Πέντε χρόνια μετά από τη σφαγή στον Ιππόδρομο ο Θεοδόσιος πεθαίνει (395) και μοιράζει το ρωμαϊκό κράτος στους δυο γιους του, τον Ονόρειο στον οποίο παραχωρεί το δυτικό τμήμα με έδρα τη Ρώμη και τον Αρκάδιο το ανατολικό με έδρα την Κωνσταντινούπολη.

Είναι η αρχή της Βυζαντινής αυτοκρατορίας και η Θεσσαλονίκη τους επόμενους αιώνες εξελίσσεται στο πλαίσιο της νέας αυτής αυτοκρατορίας.

Άβαροσλαβικες επιδρομές

Από τα μέσα του 6ου αιώνα η Θεσσαλονίκη και οι κάτοικοι της δοκιμάζονται συχνά από επιδρομές βαρβαρικών φύλων που λεηλατούν την ύπαιθρο και απειλούν μεγάλες πόλεις,
όμως δεν καταφέρνουν να κάμψουν την αντίσταση των Θεσσαλονικέων χάρη στη γενναιότητα τους, τα ισχυρή τείχη και την “συνδρομή” του Αγίου Δημήτριου.

Το 597 (ή το 586) στην πρώτη πολιορκία των Αβαροσλάβων, με δεκάδες χιλιάδες άνδρες (η πηγή αναφέρει τον υπερβολικό αριθμό των 100.000) η Θεσσαλονίκη αμύνθηκε επιτυχώς.

Μερικά χρόνια αργότερα 5000 Σλάβοι, προσπαθούν να αιφνιδιάσουν και να εισβάλουν στην πόλη την παραμονή της εορτής του Αγίου Δημήτριου. Κατά τη διάρκεια της επίθεσης οι κάτοικοι τη πόλης παρακολουθούσαν την αγρυπνία στο ναό του πολιούχου και αμέσως ξεσηκώνονται για να αποκρούσουν τους εισβολείς, οι οποίοι υποχωρούν άτακτα.

Οι Σλάβοι πολιορκούν ξανά τη Θεσσαλονίκη το 615, από ξηρά και από θάλασσα. Σε μερικές μέρες ο στόλος τους από μονόξυλα καταστρέφεται από δυνατή τρικυμία και επωφελούμενοι από τη σύγχυση των επιτιθεμένων, οι Θεσσαλονικείς ορμούν και τους αναγκάζουν σε υποχώρηση. Για άλλη μια φορά ο Άγιος Δημήτριος βρίσκεται στο πλευρό των κατοίκων και σώζει την πόλη από την καταστροφή.

Το 618 Σλάβοι που ζουν στη Μακεδονία με τη συνδρομή των Αβάρων, πραγματοποιούν άλλη μια επιδρομή η οποία σταματά στα τείχη της Θεσσαλονίκης

Μέτα τον καταστροφικό σεισμό του 620, σλαβικά φύλα θέλοντας να επωφεληθούν από την γενικευμένη σύγχυση που επικρατεί στην πόλη, προσπαθούν να εισβάλουν. Όμως ενισχύσεις από την Κωνσταντινούπολη φτάνουν έγκαιρα και έτσι αποτυγχάνει και αυτή η επίθεση.

Η Θεσσαλονίκη σώζεται άλλη μια φορά το 675-677 από την επίθεση των Σλάβων, που όμως συνεχίζουν να λεηλατούν την ύπαιθρο. Έτσι ο Ιουστινιανός Β΄ ο Ρινότμητος το 688 νικά τους Βουλγάρους και τους Σλάβους και εισέρχεται θριαμβευτικά στη Θεσσαλονίκη. Χιλιάδες Σλάβοι από τη Μακεδονία μεταφέρονται στη Μ. Ασία.

Ύστερα από την αποδυνάμωση των σλαβικών φυλών, η περιοχή γνωρίζει ειρήνη και οι σχέσεις των Σλάβων, που είχαν παραμείνει και των Ελλήνων, περνούν σε νέα διάσταση αναπτύσσοντας εμπορικές και πολιτισμικές σχέσεις.

Η Θεσσαλονίκη γνωρίζει οικονομική και πνευματική άνθηση, η εύφορη ύπαιθρος καλλιεργείται εντατικά, η βιοτεχνία αναπτύσσεται, το εμπόριο ακμάζει με εμπορεύματα και προϊόντα που ταξιδεύουν από θάλασσα και από στεριά. Άλλωστε εδώ και αιώνες το λιμάνι της Θεσσαλονίκης και η Εγνατία οδός, παίζουν σημαντικό ρόλο όχι μόνο στο εμπόριο αλλά και στη μετάδοση γνώσης και πολιτισμού.

Κύριλλος και Μεθόδιος

Στις αρχές του 9ου αιώνα γεννιούνται στη Θεσσαλονίκη δυο αδέρφια που έμελλε να αναλάβουν το δύσκολο έργο της μετάδοσης του χριστιανισμού και του βυζαντινού πολιτισμού στους Σλάβους της Βαλκανικής. Οι Κύριλλος και Μεθόδιος, γιοι στρατιωτικού αξιωματούχου της Θεσσαλονίκης, εντάχθηκαν στο σχέδιο του Βυζαντίου για τον εκχριστιανισμό των σλαβικών λαών. Τα δυο αδέρφια δημιουργούν την αλφάβητο των Σλάβων, μεταφράζουν κείμενα στην παλαιοσλαβική και δημιουργούν τα πρώτα έργα της σλαβικής φιλολογίας.

Άλωση της Θεσσαλονίκης από τους Σαρακηνούς

Η ευημερία και η πρόοδος της πόλης διακόπτεται βίαια στις αρχές του 10ου αιώνα με την εμφάνιση των Σαρακηνών πειρατών στον κόλπο του Θερμαΐκού.

Από το 824 Σαρακηνοί έχουν καταλάβει την Κρήτη και με ορμητήριο τα λιμάνια της λεηλατούν τα νησιά και τις πόλεις του Αιγαίου. Ο Βυζαντινός στόλος δεν καταφέρνει να τους αναχαιτίσει και εκείνοι βρίσκουν την ευκαιρία να κινηθούν προς τη Θεσσαλονίκη με αρχηγό τους τον εξωμότη Λέοντα Τριπολίτη.

Στην παρούσα φάση η Θεσσαλονίκη είναι μάλλον απροετοίμαστη για ένα τέτοιο κίνδυνο
με ελλειπή οχυρωματικά τείχη και αλλαγές στη διοίκηση που καθυστερούν ακόμη περισσότερο την προετοιμασία της πόλης.

Οι Σαρακηνοί εμφανίζονται στο Θερμαϊκό κόλπο μπροστά στο λιμάνι της Θεσσαλονίκης το πρωί της 29ης Ιουνίου του 904. Την τρίτη ημέρα της πολιορκίας οι Σαρακηνοί πειρατές πραγματοποιούν έφοδο δια θαλάσσης έχοντας κατασκευάσει ξύλινους πύργους πάνω στα καράβια τους, που ξεπερνούν σε ύψος το θαλάσσιο τείχος. Με αυτόν τον τρόπο κατορθώνουν να εισβάλλουν στην πόλη προκαλώντας χάος και πανικό στους κατοίκους της.

Σφαγές και λεηλασίες ακολούθησαν την εισβολή και διήρκεσαν δέκα ημέρες. Χιλιάδες αιχμάλωτοι και λάφυρα φορτώθηκαν στα πλοία με προορισμό την Κρήτη και τα σκλαβοπάζαρα της Ανατολής.

Παρά τη μεγάλη καταστροφή, η πόλη ξαναγεννιέται μέσα από τις στάχτες της. Τα θαλάσσια τείχη επισκευάζονται και η πόλη συνεχίζει να ακμάζει.

Επιδρομές των Βουλγάρων

Κατά την περίοδο της Μακεδονικής Δυναστείας (867-1059) οι Βούλγαροι ηγεμόνες Συμεών(893-927) και Σαμουήλ(976-1014) προχωρούν σε αλλεπάλληλες επιδρομές στις περιοχές της Βαλκανικής και απειλούν τη Θεσσαλονίκη που χρησιμοποιείται ως κέντρο των πολεμικών επιχειρήσεων έναντι των Βουλγάρων.

Το 1014 μετά το θάνατο του Σαμουήλ, η Βουλγαρία γίνεται βυζαντινή επαρχία .Η αυτοκρατορία του Βυζαντίου φτάνει τότε στη μεγαλύτερή της έκταση έχοντας σαν βόρειο σύνορα τον Δούναβη.

Το 1040 οι Βούλγαροι επαναστατούν με αρχηγό τον Πέτρο Δελεάνου ο οποίος ανακηρύσσεται τσάρος. Ο στρατός του κατευθύνεται προς το νότο καταλαμβάνοντας περιοχές και πολιορκεί τη Θεσσαλονίκη με 40.0000 άντρες. Με μια ηρωική έξοδο των κατοίκων, στο πλευρό των οποίων βρίσκεται για άλλη μια φορά ο Άγιος Δημήτριος, απωθούν τους εχθρούς και λύεται η πολιορκία.

Νορμανδική Κατάκτηση

Οι Νορμανδοί μετά την κατάληψη βυζαντινών επαρχιών στη Νότια Ιταλία επιχειρούν εκστρατείες έναντι των ανατολικών επαρχιών της Βυζαντινής Αυτοκρατορίας. Το 1185 καταλαμβάνουν το Δυρράχιο το όποιο αποτελούσε την αρχή της Εγνατίας οδού και πολιορκούν τη Θεσσαλονίκη από στεριά και θάλασσα με 80.000 στρατιώτες και 200 καράβια.

Παρά τη γενναία αντίσταση των κατοίκων και τα ισχυρά τείχη, η ανικανότητα της διοίκησης και η ελλιπής οργάνωση της άμυνας, οδήγησαν στην κατάληψη της πόλης από τους Νορμανδούς στις 24 Αυγούστου του 1185.

Η Θεσσαλονίκη ακόμη μια φορά μετά την επέλαση των Νορμανδών έζησε σφαγές βιασμούς και λεηλασίες, ανάλογης σκληρότητας με αυτές των Σαρακηνών πειρατών.

Η Νορμανδική καταπίεση διήρκεσε έναν χρόνο. Μέτα την ήττα του νορμανδικού στρατού κοντά στην Αμφίπολη αποχωρούν από τη Μακεδονία και τη Θεσσαλονίκη.

Φραγκοκρατία (1204-1224)

Μετά την άλωση της Κωνσταντινούπολης το 1204 από τους Φράγκους της 4ης σταυροφορίας, ακολουθεί και η παράδοση της Θεσσαλονίκης. Η βυζαντινή αυτοκρατορία διαλύεται και στη θέση της δημιουργούνται φράγκικα και ελληνικά κράτη.

Η Θεσσαλονίκη μαζί με άλλες περιοχές της Μακεδονίας παραχωρείται στον Βονιφάντιο τον Μομφερατικό, ο οποίος ιδρύει το Φράγκικο βασίλειο της Θεσσαλονίκης.

Το 1205 ενώ ο Βονιφάντιος βρίσκεται σε εκστρατεία στη Νότια Ελλάδα, πληροφορείται από τη σύζυγό του Μαρία την Ουγγρική για τις μυστικές συνεννοήσεις των κατοίκων της Θεσσαλονίκης με τον Βούλγαρο τσάρο Ιωαννίτση.
Μετά από λίγο οι Βούλγαροι αποχωρούν και ο Βονιφάντιος επιστρέφει εσπευσμένα στη Θεσσαλονίκη όπου και τιμωρεί σκληρά τους υπεύθυνους.

Μετά το θάνατο του Βονιφάντιου το 1207 ο Ιωαννίτσης προσπαθεί να εκμεταλλευτεί την ευκαιρία και πολιορκεί τη Θεσσαλονίκη. Κατά τη διάρκεια της πολιορκίας ο Ιωαννίτσης δολοφονείται στη σκηνή του, η πολιορκία παύει και η πόλη σώζεται. Οι κάτοικοι αποδίδουν τη σωτηρία τους στην επέμβαση του πολιούχου της πόλης τον Άγιο Δημήτριο.

Πρωτεύουσα Ελλήνων Ηγεμόνων (1224-1246)

Το 1224 μπαίνει νικητής στη Θεσσαλονίκη ο ηγεμόνας της Ηπείρου, Θεόδωρος Κομνηνός Δούκας και στέφεται βασιλιάς την άνοιξη του ίδιου έτους. Ως βασιλιάς της Μακεδονίας καταλαμβάνει πολλές περιοχές και επεκτείνει το βασίλειό του από την Αδριατική και το Ιόνιο έως τον Έβρο με απώτερο στόχο την κατάκτηση της Κωνσταντινούπολης και την ανασύσταση της Βυζαντινής αυτοκρατορίας .

Όμως το 1230 ο Θεόδωρος Δούκας χάνει τη μάχη της Κλοκονίτσας κοντά στον Έβρο από τον τσάρο των Βουλγάρων Ιωάννη Ασάν Β’ ο οποίος τον αιχμαλωτίζει .Σύντομα πολλές περιοχές της Μακεδονίας και της Θράκης περνούν στα χέρια του Ασάν.

Το βασίλειο της Θεσσαλονίκης συρρικνώθηκε και τη διοίκηση αναλαμβάνουν συγγενείς του Θεοδώρου έως το 1246.

Το 1246 η Θεσσαλονίκη περνάει στα χέρια του αυτοκράτορα της Νίκαιας Ιωάννη Δούκα Βατάτζη. Τη διοίκηση της αναλαμβάνει ο Ανδρόνικος Παλαιολόγος, πατέρας του μετέπειτα αυτοκράτορα Μιχαήλ Η’.

Η Θεσσαλονίκη ξανά Συμβασιλεύουσα

Ο Μιχαήλ Η’ ανακτά την Κωνσταντινούπολη το 1261, και τερματίζει τη Λατινοκρατία. Προχωρά στην ανασυγκρότηση του βυζαντινού κράτους που όμως είναι περιορισμένη, γεωγραφικά και οικονομικά αντιμετωπίζοντας σοβαρά προβλήματα.

Η απώλεια πλούσιων εδαφών και τα εμπορικά προνόμια που έχουν παραχωρηθεί σε σημαντικές εμπορικές πόλεις της Ιταλίας, κυρίως της Γένουας και της Βενετίας αποδυναμώνουν περισσότερο την αυτοκρατορία.

Στις αρχές του 14ου αιώνα η Θεσσαλονίκη αντιμετωπίζει έναν νέο εχθρό. Καταλανοί μισθοφόροι που πολιορκούν την πόλη. Οι Καταλανοί είχαν προσληφθεί από τον αυτοκράτορα Ανδρόνικο Β’ για να αναχαιτίσει τις επιθέσεις των Τούρκων στη Μικρά Ασία. Όμως με αφορμή την αδυναμία πληρωμής από τον Ανδρόνικο προχώρησαν σε λεηλασίες στη Μακεδονία και τη Θράκη. Μετατρέπουν τη χερσόνησο της Κασσάνδρας σε ορμητήριο για τις επιδρομές τους στο Άγιο Όρος και τη Χαλκιδική.

Οι Καταλανοί μισθοφόροι εμφανίζοντα μπροστά στα τείχη της Θεσσαλονίκης την άνοιξη του 1308 και πολιορκούν την πόλη. Ενισχύσεις φτάνουν έγκαιρα από την Κωνσταντινούπολη και έτσι η πόλη σώζεται από βέβαιη καταστροφή. Οι Καταλανοί μετά την ήττα τους στρέφονται προς τη νότια Ελλάδα.

Κατά τον 14ο αιώνα παρά την αποδυνάμωση και την γενικότερη παρακμή της βυζαντινής αυτοκρατορίας η Θεσσαλονίκη αναπτύσσεται και προοδεύει. Αναδεικνύεται σε σημαντικό κέντρο πολιτισμού όπου αναπτύσσονται τα γράμματα και οι τέχνες. Η ιδιότυπη αυτοδιοίκηση της ενισχύει ακόμα περισσότερο την ανάπτυξη νέων ιδεών και πεποιθήσεων. Από κάθε σημείο της αυτοκρατορίας πολίτες καταφθάνουν στη Θεσσαλονίκη για να μαθητεύσουν δίπλα στους καλύτερους δασκάλους της εποχής.

Κατά τον 14ο αιώνα αναδείχτηκαν σημαντικοί Θεσσαλονικείς φιλόσοφοι, νομικοί και καλλιτέχνες οι οποίοι άφησαν πίσω τους σημαντικό έργο.

Τον θάνατο του Ανδρόνικου Β’(1341) ακολουθεί μακροχρόνια εμφύλια διαμάχη για τη διαδοχή ανάμεσα στον νόμιμο αυτοκράτορα Ιωάννη Ε’ και τον Ιωάννη Καντακουζηνό στην διάρκεια της οποίας η Θεσσαλονίκη αποτελεί κέντρο πολιτικών και κοινωνικών εξελίξεων, με αποκορύφωμα το κίνημα των Ζηλωτών.

Ζηλωτές

Θρησκευτικές συγκρούσεις πραγματοποιήθηκαν από το 1339 έως το τέλος σχεδόν του 14 ου αιώνα.

Ο 14ος αιώνας είναι ο χρυσός αιώνας για το Βυζάντιο και τη Θεσσαλονίκη αφού αναπτύχθηκαν η παιδεία, η ζωγραφική και ανεγέρθηκαν τα περισσότερα βυζαντινά μνημεία .Χαρακτηρίζεται όμως και ως αιώνας συγκρούσεων και κοινωνικών αναταραχών.

Την περίοδο αυτή στο θρόνο της Βυζαντινής αυτοκρατορίας βρίσκεται ο διάδοχος Ιωάννης Ε΄ Παλαιολόγος.

Τον θρόνο όμως, διεκδικούν οι Ιωάννης Καντακουζηνός και Αλέξιος Απόκαυκος. Ο Καντακουζηνός έχει στο πλευρό του τους ευγενείς και ο Αποκαυκος, την αυτοκράτειρα Άννα μητέρα του Ιωάννη Ε Παλαιολόγου και τον λαό της Θεσσαλονίκης.

Σε αυτό το κοινωνικοπολιτικό πλαίσιο σε πολλές πόλεις ξεσπούν διαμάχες και συγκρούσεις.

Αρχικά εκδηλώνεται το κίνημα των Ησυχαστών, οι οποίοι πρέσβευαν ότι η επαφή με το Θεό γίνεται με νοερή προσευχή σκύβοντας το κεφάλι στο στήθος. Ηγέτης των Ησυχαστών ήταν ο Γρηγόριος Παλαμάς.

Το αντίπαλο δέος με ηγέτη το μοναχό Βαρλαάμ τους κατηγόρησε ως ειδωλολάτρες και μυστικιστές. Τελικά η αναγνώριση από το πατριαρχείο των Ησυχαστών έδωσε τέλος στη διαμάχη. Αξίζει να σημειωθεί πως με την επικράτηση των Ησυχαστών η παιδεία και η φιλοσοφία καθυστέρησαν για την Θεσσαλονίκη αλλά ανέδειξαν την εκκλησιαστική τέχνη.
Το κίνημα των Ζηλωτών, η πρώτη “Λαϊκή δημοκρατία” επικράτησε στη Θεσσαλονίκη κατά τον εμφύλιο των διεκδικητών του θρόνου. Μετά τη νίκη τους κατέλαβαν όλα τα δημόσια αξιώματα, εγκαθίδρυσαν λαϊκή αυτοδιοίκηση, κατάργησαν προνόμια της αριστοκρατίας και δήμευσαν περιουσίες πλουσίων.

Τα αντίποινα δεν άργησαν και οργανώθηκαν από την αυτοκρατορική κυβέρνηση. Οι Ζηλωτές ανατράπηκαν το 1349 και τη Θεσσαλονίκη κατέλαβε ο Ιωάννης Καντακουζηνός.

Το κίνημα των Ζηλωτών προπαντός ήταν ένα κίνημα κοινωνικοπολιτικό έχοντας όμως- όπως πρόσταζε η εποχή – και θρησκευτικές αναφορές

Χαρακτηρίζεται από ιδέες προοδευτικές για την εποχή και εναντιώνονται στους ευγενείς, στους πλούσιους και γενικά εναντίον των προνομιούχων, που είχαν συγκεντρώσει στα χέρια τους τον πλούτο και την εξουσία, καταδυναστεύοντας τον λαό.

Τουρκοκρατία
Κατά την τελευταία πενηντακονταετία της η Βυζαντινή αυτοκρατορία παρήκμασε και αυτό εκμεταλλεύτηκαν οι Οθωμανοί, οι οποίοι άρχισαν να κατακτούν σταδιακά τις επαρχιακές πόλεις γύρω από τη Θεσσαλονίκη.

Το 1430 δεν ήταν η πρώτη φορά που οι Τούρκοι κατέκτησαν τη Θεσσαλονίκη αφού το 1337 μετά από 4ετή πολιορκία, ο Βαγιαζίτ Α΄ έθεσε την πόλη σε φόρο υποτέλειας χωρίς ωστόσο να την συμπεριλάβει σε Οθωμανική Διοίκηση.

Στα επόμενα χρόνια αλλεπάλληλες επιθέσεις και πολιορκίες εξασθένησαν την πόλη και τους κατοίκους. Ο κυβερνήτης Ανδρόνικος τότε αποφασίζει να παραδώσει την Θεσσαλονίκη στους Βενετούς με τον όρο να σωθεί η πόλη.

Η τυραννική στάση των Βενετών όμως απέναντι στους κατοίκους και η ελλιπής οχύρωση της πόλης οδήγησαν πολλούς από τους κατοίκους της Θεσσαλονίκης να φύγουν και να εγκατασταθούν σε πιο ασφαλείς περιοχές.

Στις 29 Μαρτίου 1430 ο σουλτάνος Μουράτ Β΄καταλαμβάνει την πόλη και για δύο μερόνυχτα ο τούρκικος στρατός λεηλατεί, σκοτώνει και σκλαβώνει τους κατοίκους.

Ο σουλτάνος θα προσευχηθεί για πρώτη φορά στην εκκλησία της Αχειροποιήτου η οποία ήταν η πρώτη εκκλησία που μετατράπηκε σε τζαμί.

Τα πρώτα χρόνια της Οθωμανικής κυριαρχίας ο πληθυσμός της Θεσσαλονίκης δεν ξεπερνά τις 7000 ψυχές. Ο σουλτάνος αντιλήφθηκε σύντομα πως η πόλη πρέπει να αναγεννηθεί. Διατάζει τότε να εγκατασταθούν στην πόλη Μουσουλμάνοι από την περιοχή των Γιαννιτσών.

Παράλληλα επιτρέπει στους Εβραίους να κατοικήσουν στη Θεσσαλονίκη, οι οποίοι ειχαν διωχθεί από τη δυτική Ευρώπη. Σταδιακά απελευθερώθηκαν Χριστιανοί – για πολλούς από αυτούς πλήρωσε ο ίδιος ο Μουράτ Β΄τα λύτρα και προέτρεψε το ίδιο και τους αξιωματούχους του – και τους επιτράπηκε να επιστρέψουν στα σπίτια τους. Οι περισσότεροι δημιούργησαν γειτονιές γύρω από τις εκκλησίες που δεν είχαν μετατραπεί σε τζαμιά.

Επίσημη απογραφή του 1519 καταγράφει το σύνολο των κατοίκων στη Θεσσαλονίκη που έφθανε του 29.220. (15.715 ήταν Εβραίοι, 6.875 Μουσουλμάνοι και 6.635 Χριστιανοί.)

Τα πρώτα χρόνια Τούρκοι και Έλληνες ζούσαν σε γειτονικές συνοικίες. Σταδιακά οι τρεις μεγάλες κοινότητες Μουσουλμάνοι, Εβραίοι και Χριστιανοί αρχίζουν να οριοθετούν άτυπα σύνορα και μετακινούνται σε διαφορετικούς οικισμούς.

Οι Μουσουλμάνοι θα εγκατασταθούν στην Άνω πόλη και την Ακρόπολη για να αποφύγουν τις ανθυγιεινές ξυλοσκέπαστες γειτονιές και να διατηρούν την πλήρη θέα και τον έλεγχο του υπόλοιπου πληθυσμού .Τα σπίτια τους χτίστηκαν με θέα τον Θερμαΐκό χωρίς ρυμοτομία, κάτι που ακόμη χαρακτηρίζει την περιοχή αυτή της Θεσσαλονίκης.

Οι Χριστιανοί ζούσαν κυρίως στο Ανατολικό τμήμα του κέντρου κατά μήκος της σημερινής Εγνατίας και γύρω από εκκλησίες που παρέμειναν χριστιανικές .
Οι Εβραίοι εγκαταστάθηκαν στην περιοχή της αγοράς από την παραλία ως το ύψος της Εγνατίας στο νοτιοδυτικό τμήμα της πόλης. Η περιοχή ήταν η πιο ανθυγιεινή χωρίς νερό και χωρίς καθαριότητα. Πυρκαγιές εκδηλωνόταν συχνά και κατάκαιγαν τα ξύλινα σπίτια σε όλο το κέντρο.Ενώ επιδημίες, ιδιαίτερα τους καλοκαιρινούς μήνες, προκαλούσαν το θάνατο χιλιάδων ανθρώπων.

Ανάμεσα στις δύο συνοικίες, εκεί που σήμερα βρίσκουμε την Αρχαία Αγορά μέχρι την Εγνατία οδό είχαν εγκατασταθεί οι Ντονμέδες. Πρόκειται για Εβραίους που ακολούθησαν τη διδασκαλία του ψευδοπροφήτη Σαμπατάι Σεβή. Εμφανίστηκε και άρχισε να διδάσκει το 1655 ενώ αργότερα ασπάστηκε το Μωαμεθανισμό. Όσοι τον ακολούθησαν και εξισλαμίστηκαν απομακρύνθηκαν από τους υπόλοιπους Εβραίους τόσο θρησκευτικά αλλά και κοινωνικά. Οι Ντονμέδες ήταν κυρίως μορφωμένοι και εύποροι Εβραίοι.

Κάθε κοινότητα είχε τη δική της οργάνωση και επικεφαλής οριζόταν οι θρησκευτικοί τους ηγέτες. Στην Τουρκική δικαιοσύνη σπάνια κατέφευγαν οι Έλληνες ενώ οι Εβραίοι ποτέ. Οι μουσουλμάνοι εκπροσωπούνταν από τους πρόκριτους.

Οι λίγοι Ευρωπαίοι υπήκοοι ,πρόξενοι, υπάλληλοι προξενείων και έμποροι είχαν σημαντικό κύρος και επηρέαζαν την οικονομική ζωή της Θεσσαλονίκης.

Ζούσαν στη σημερινή περιοχή γνωστή ως Φραγκομαχαλάς. Όσοι Έλληνες και Εβραίοι συνεργαζόταν μαζί τους είχαν δικαίωμα σε φορολογικές απαλλαγές και άλλα προνόμια τα οποία πολλές φορές γινόταν λόγος έριδας και καβγάδων με τους υπόλοιπους. Οι Ευρωπαίοι υπήκοοι υπολογίζονται εκείνη την περίοδο περί τα 2000 άτομα.

Η οικονομική ζωή της Θεσσαλονίκης επηρεαζόταν από τους Έλληνες και τους Εβραίους και από κοινού βρισκόταν σε έντονο συναγωνισμό με το Φράγκικο στοιχείο που εξυπηρετούσαν κυρίως συμφέροντα των χωρών τους.

Κατά τη διάρκεια των πρώτων αιώνων της Οθωμανικής κυριαρχίας, η Θεσσαλονίκη παρήκμασε και ολοκληρώθηκε ο εξισλαμισμός της πόλης. Αυτό επιτεύχθηκε με την μετατροπή των εκκλησιών σε τζαμιά. Για τους μουσουλμάνους τα τζαμιά αποτελούσαν κέντρα για τη θρησκευτική και εκπαιδευτική ζωή τους. Συνολικά είχαν καταγραφεί 38 μιναρέδες και 49 συνοικιακά τεμένη.

Ανάλογης σημασίας για τη ζωή των μουσουλμάνων ήταν οι τεκέδες. Πρόκειται για θρησκευτικά ιδρύματα που ζούσαν οι δερβίσηδες. Ο ρόλος των δερβίσηδων κάλυπτε την ιατρική, τη θρησκεία και καθημερινές συμβουλές διαβίωσης αφού βρισκόταν πιο κοντά στο λαό σε σχέση με τους θρησκευτικούς ηγέτες του.

Ο μεγαλύτερος τεκές στη Θεσσαλονίκη ήταν των Μεβλελήδων – των περιστρεφόμενων δερβίσηδων – και βρισκόταν δυτικά, εκεί που καταλήγει η οδός Αγίου Δημητρίου.

Πολύ σημαντικά και απαραίτητα για την κάθαρση των πιστών ήταν τα Λουτρά. Στη Θεσσαλονίκη το πρώτο λουτρό χτίστηκε από τον Μουράτ, τα γνωστά λουτρά Παράδεισος. Είναι διπλό λουτρό με ξεχωριστή είσοδο για άντρες και για γυναίκες και λειτουργούσε χωρίς διακοπή ως το 1968.

Άλλα τουρκικά μνημεία στη Θεσσαλονίκη είναι το Μπεζεστένι, σκεπαστή κλειστή αγορά επί της οδού Βενιζέλου κοντά στην Εγνατία. Εκεί εμπορευόταν χρυσάφι, μεταξωτά και πολυτελή υφάσματα. Χτίστηκε στα τέλη του 15ου αι από τον Βαγιαζίτ Β΄.

Το Αλατζά Ιμαρέτ λειτουργούσε και ως πτωχοκομείο. Πήρε το όνομά του ¨Αλατζά¨ από τις πολύχρωμες διακοσμήσεις του.

Τέλος ο Πύργος του Αίματος, η διαβόητη φυλακή που ένωνε το Ανατολικό με το Παραλιακό τείχος της Θεσσαλονίκης. Σήμερα είναι γνωστός σε όλους, αφού είναι η εικόνα της πόλης, ο Λευκός Πύργος και χτίστηκε περίπου το 1535.

Αρχικά ήταν χώρος θλίψης και πόνου αφού τα βασανιστήρια και οι αποκεφαλισμοί των φυλακισμένων από τους Γενίτσαρους λάμβαναν μέρος σε καθημερινή βάση. Αυτός ήταν ο λόγος που πήρε την αρχική του ονομασία Πύργος του Αίματος.

Σήμερα ο Λευκός Πύργος λειτουργεί ως Μουσείο, στεγάζει και εξιστορεί την ιστορία της Θεσσαλονίκης με χρήση σύγχρονου οπτικοακουστικού εξοπλισμού.

Ο 18ος αι βρίσκει την νεόδμητη Ελληνική αστική τάξη σε άνθιση και ιδρύονται τα πρώτα σχολεία και οι πρώτοι σύλλογοι. Η Ελληνική κοινότητα ενισχύεται ενώ παρατηρούνται τα πρώτα σημάδια εθνικής αφύπνισης.

Οι μεγάλες αλλαγές ωστόσο πραγματοποιήθηκαν κατά τον 19ο αι στη Θεσσαλονίκη. Παρά το γεγονός ότι βρισκόταν ακόμη υπό Τουρκική κατοχή και απελευθερώθηκε μόλις το 1912, μεγάλες μεταρρυθμίσεις σηματοδότησαν την περιοχή.

Η Ελληνική κοινότητα δραστηριοποιείται πιο έντονα, ανοίγουν σχολεία ανώτερης μόρφωσης, αρχίζουν να κυκλοφορούν οι πρώτες εφημερίδες και ξεκινά ο εξευρωπαϊσμός της Θεσσαλονίκης.

Το 1873 αρχίζει η σταδιακή κατεδάφιση του θαλάσσιου τείχους και δημιουργείται προκυμαία. Ο καθαρός αέρας συμβάλλει στην “απελευθέρωση” της πόλης από λοιμούς και επιδημίες.
Η πόλη αρχίζει να επεκτείνεται προς τη συνοικία των Εξοχών. Είναι η σημερινή Βασιλισσης Όλγας όπου άρχισαν να χτίζονται οι εξοχικές κατοικίες των πλούσιων Θεσσαλονικέων. Στη συνέχεια έγιναν μόνιμες κατοικίες που τις προτιμούσαν οι οικονομικά εύρωστοι κάτοικοι ανεξαρτήτως εθνικότητας.

Η Θεσσαλονίκη συνδέεται σιδηροδρομικώς με την Κωνσταντινούπολη και την Ευρώπη.
Στα τέλη του 1800 κυκλοφορούν τα πρώτα τραμ στην πόλη, τα οποία είναι ιππήλατα. Θα γίνουν ηλεκτροκίνητα το 1907.

Λίγο πριν, κατασκευάζεται το πρώτο τεχνητό λιμάνι της Θεσσαλονίκης από Γάλλους μηχανικούς.

Παρά τις ανατινάξεις κτιρίων από τους Βούλγαρους κομιτατζήδες και τις ένοπλες συγκρούσεις με τον Ελληνικό στρατό, που ορίζουν την αρχή των Μακεδονικών αγώνων, η Θεσσαλονίκη παραμένει τόπος σημαντικής γεωγραφικής και πολιτικής σημασίας.

Κυκλοφορούν και άλλες εφημερίδες μεταξύ των οποίων η εφημερίδα ¨Μακεδονία¨,η μακροβιότερη εφημερίδα της πόλης.

Τον Οκτώβριο του 1912 η Θεσσαλονίκη απελευθερώνεται από τον νικηφόρο Ελληνικό στρατό. Ο Τούρκος διοικητής θα υπογράψει το πρωτόκολλο παράδοσης και η πόλη θα περάσει στην ελληνική επικράτεια χωρίς να γίνει μάχη.

Η συνθήκη η οποία επισφράγισε επίσημα ότι η Θεσσαλονίκη προσαρτάται πλέον στο ελληνικό κράτος, υπεγράφη στο Βουκουρέστι το 1913.

Η δοξολογία της απελευθέρωσης εψάλλει στον Άγιο Μηνά, εκκλησία που παρέμεινε ορθόδοξη για όλη τη διάρκεια της Τουρκοκρατίας.
"""
